# CanCreateOnMultistoryStairs Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsPath..::..CanCreateOnMultistoryStairs Method
StairsPath Class See Also
---
Checks if more stairs paths can be added on the plan views of a multistory stairs.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool CanCreateOnMultistoryStairs(
	Document document,
	LinkElementId multistoryStairsId
)
```

Visual Basic
---
```text
Public Shared Function CanCreateOnMultistoryStairs ( _
	document As Document, _
	multistoryStairsId As LinkElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool CanCreateOnMultistoryStairs(
	Document^ document,
	LinkElementId^ multistoryStairsId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document
multistoryStairsId
    Type: Autodesk.Revit.DB..::..LinkElementId The multistory stairs id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace